#' Завдання 1: Обчислення та виведення значення функції.
#'
#' Завдання полягає у наступному:
#' 1. Застосовуючи довідку, знайдіть інформацію про функції rm(), ls().
#' 2. Змінній y привласніть значення виразу: log2(sin(atan(1))^2).
#' 3. Виведіть це значення на екран.
#' 4. Виконайте команду: x <- runif(10^5, min = -1, max = 1).
#' 5. Видаліть об’єкт х з пам’яті.
#' 6. Виведіть список змінних, що знаходяться у пам’яті

# appropriation
y<-log2(sin(atan(1))^2)
y
x <- runif(10^5, min= -1, max = 1)
x

# checking elements in the session
ls()

# removing an item from a session
rm(x)
