#' Напишіть вираз для визначення того, що в тризначному числі є однакові цифри. 
#' Перевірити роботу програми для чисел 389 і 838.

A <- 389
B <- 838

# Отримаємо окремі цифри з чисел
digit_A <- c(A %/% 100, (A %% 100) %/% 10, A %% 10)
digit_B <- c(B %/% 100, (B %% 100) %/% 10, B %% 10)

# Перевіряємо, чи є серед цир однакові
result_A <- any(duplicated(digit_A))
result_B <- any(duplicated(digit_B))

print(paste('Число', A, ifelse(result_A, 'має', "не має"), "однакових цифр."))
print(paste('Число', B, ifelse(result_B, 'має', "не має"), "однакових цифр."))
